<?php
namespace backend\components;

/**
 * 工具类
 * 存放静态方法及数据
 */
class Tool
{
    const LUCKY_STATUS         = ['' => '全部','1' => '正常', '0' => '失效'];                                    //红包状态定义
    const LUCKY_ISEXPIRE       = ['0' => '固定时间段', '1' => '非固定时间段'];                           //红包是否有固定时间
    const LUCKY_KIND           = [ '1' => '满额减', '2' => '折扣'];                                  //红包类型
    const LUCKY_USE_STATUS     = [ '0' => '未使用', '1' => '已使用', '2' => '已过期'];                  //用户红包的状态
    const TRADE_STATUS         = [                                                                //订单状态
                                    "" => '全部','1'=>'待付款', '2'=>'待出行', '3'=>'待评价', '4'=>'订单已完成',
                                    '5'=>'申请退款', '6'=>'退款中', '7'=>'退款成功', '8'=>'订单已关闭'
                                 ];   
    const RAGIN                = [
                                    "209"=>"黄浦区","210"=>"卢湾区",                                  //目前上海市区域
                                    "211"=>"徐汇区","212"=>"长宁区","213"=>"静安区",
                                    "214"=>"普陀区","215"=>"闸北区","216"=>"虹口区",
                                    "217"=>"杨浦区","218"=>"宝山区","219"=>"闵行区",
                                    "220"=>"嘉定区","221"=>"松江区","222"=>"金山区",
                                    "223"=>"青浦区","224"=>"南汇区","225"=>"奉贤区",
                                    "226"=>"浦东新区","227"=>"崇明县","228"=>"其他",
                                    ]; 
    const ACTIVE_ACTIVITYKIND  = ['1' => '其他' , '2' => '自营'];                                    //创建活动-活动类型
    const ACTIVE_STATUS        = ['0' => '下架' ,'1' => '正常'];                                     //创建活动-活动状态
    const ACTIVE_STARS         = [
                                     '5' => '5星', '4' => '4星', '3' => '3星',                      //创建活动-活动星级
                                     '2' => '2星', '1' => '1星'
                                 ];
    const ACTIVE_ABILITY       = [
                                    '1' => '适应环境','2' => '独立自主','3' => '团队协作',                //创建活动-活动能力培养项
                                    '4' => '沟通表达'
                                 ];
    const ACTIVE_AGEGROUP      = ['1' => '3-6', '2'=> '7-10', '3'=>'11-14', '4'=>'15-17'];        //创建活动-活动适应年龄段
    const ACTIVE_PRICEKIND     = ['1' => '一大一小（打包）' ,'2' => '大人小孩分开计算', '3' => '只有小孩'];    //创建活动-活动价格类型
    const ACTIVE_INSURANCE     = ['1' => '需要','0' => '不需要'];                                    //创建活动-是否需要保险
    const ACTIVE_COMMENT_TOP   = ['0' => '否', '1' => '是'];                                       //活动评论-是否推荐到评论首位
    
    const ACTIVE_COMMENT_DISPLAY = ['0' => '不显示', '1' => '显示'];                                 //活动评论-显示
    
    const BANNER_STATUS        = ['1' => '是','0' => '否'];                                   //网站配置-是否启用
    const BANNER_TYPE          = ['1' => 'web首页轮播图','2' => '移动首页轮播图','3' => '首页活动','4' => '首页圈子话题'];
    const BANNER_ATYPE         = ['1' => '活动','2' => '活动圈子'];                               //网站配置-关联类型
    const CIRCLE_STATUS        = ['1' => '正常','0' => '失效'];                                  //圈子状态
    
    const MESSAGE_TYPE         = ['1' => '短信', '2' => '站内信'];                                //消息管理 -消息类型
    const THEME_TYPE           = ['0' => '普通话题','1' => '官方话题'];                             //话题类型
    const THEME_TOP            = ['0' => '不置顶' ,'1' => '置顶'];                                //主题是否置顶
    const PHONE_STATUS         = [""=> "全部" , '0' => '无手机' ,'1' => '有手机'];                               //是否有手机
    
    //输出模型中第一条错误的错误信息
    public static function echoError(&$model)
    {
        $errors = $model->getFirstErrors();
        return ['code' => 0, 'msg' => array_shift($errors)];
    }
}